{
  "ref_id": "REF-119",
  "title": "The Sciences of the Artificial",
  "authors": [
    "Simon, H.A."
  ],
  "year": 1969,
  "source_type": "book",
  "category": "X. Design",
  "original_file": "pdf/REF-119_Simon_1969_SciencesArtificial.pdf",
  "enhanced_txt": "txt/REF-119.txt",
  "images_dir": "images/REF-119/",
  "markdown_file": "md/REF-119.md",
  "page_count": 241,
  "image_count": 229,
  "token_count_estimate": 136719,
  "summary": "Simon's 'The Sciences of the Artificial' (1969) argues that artificial systems (designed by humans) require different scientific approaches than natural systems. The book establishes design science as legitimate scientific inquiry, introduces satisficing as rational decision-making under constraints, and explores how complex systems can be understood through their hierarchical organization. Simon argues that artificial systems are characterized by their purposes, their adaptation to environments, and their boundaries with nature.",
  "smoc_relevance_summary": "This book establishes that software is an artificial system amenable to scientific analysis. Simon's design science framework justifies SMoC's approach: code is designed, has purposes, adapts to environments (requirements), and can be studied scientifically. The book's treatment of hierarchical decomposition directly informs SMoC's 16-level scale. Simon's satisficing (accepting good-enough solutions) explains why code doesn't optimize globally—architects satisfice at each decision point, bounded by local information and cognitive limits. This grounds SMoC's bounded rationality assumptions.",
  "key_smoc_concepts": [
    {
      "smoc_concept": "bounded_rationality",
      "paper_concept": "Satisficing vs Optimizing",
      "mapping": "Simon argues that real decision-makers satisfice (accept first adequate solution) rather than optimize (find global best). In SMoC: architects satisfice when choosing patterns, modules, abstractions. Code doesn't exhibit global optimization because no architect has global knowledge. This explains technical debt and gradual coherence emergence—satisficing at local scales, coherence emerges from repeated local improvements, not top-down global planning.",
      "quotes_or_pages": [
        "Ch. 1: 'The sciences of the artificial'",
        "Ch. 5: 'Satisficing behavior'"
      ],
      "strength": "foundational"
    }
  ],
  "important_figures": [],
  "important_equations": [],
  "cross_references": [
    "REF-081",
    "SIMON"
  ],
  "gaps_or_extensions": "Simon works conceptually. SMoC adds formal models (categorical structure, free energy dynamics) and computational tools (Collider) that Simon envisioned but didn't build.",
  "generated_metadata": {
    "date": "2026-01-27",
    "model": "manual_analysis",
    "analyst": "llm_enrichment"
  },
  "priority_tier": 1
}
