{
  "ref_id": "GIBSON",
  "title": "GIBSON 1979 EcologicalApproachVisualPerception",
  "authors": [
    "GIBSON"
  ],
  "year": 1979,
  "source_type": "book",
  "category": "V.1 General Systems",
  "original_file": "pdf/GIBSON_1979_EcologicalApproachVisualPerception.pdf",
  "enhanced_txt": "txt/GIBSON.txt",
  "images_dir": "images/GIBSON/",
  "markdown_file": "md/GIBSON.md",
  "page_count": 347,
  "image_count": 49,
  "token_count_estimate": 228138,
  "summary": "Gibson's 'The Ecological Approach to Visual Perception' (1979) revolutionizes perceptual psychology by arguing that perception is direct detection of affordances (action possibilities) in the environment, not construction of internal representations. Gibson introduces the concepts of affordance, ecological information, and the ambient optic array. The book challenges representationalist theories, arguing that animals perceive meaning (what they can do) directly from structured light, without inferring it from sensations.",
  "smoc_relevance_summary": "Gibson's affordances are the foundation of SMoC's STONE TOOL PRINCIPLE. Code affords different actions to different agents: a Python function affords 'call with args' to humans, 'extract signature' to static analyzers, 'infer type' to type checkers, 'refactor' to AI agents. SMoC inverts traditional tool design: instead of making tools afford human comprehension, make code afford AI comprehension (AI-native tooling). Affordances are relational—they exist in the code-agent coupling, not in code alone. This explains why 'self-documenting code' fails: code affords execution, not necessarily understanding. Documentation provides different affordances (explanation, rationale) that code cannot.",
  "key_smoc_concepts": [
    {
      "smoc_concept": "affordances_stone_tool",
      "paper_concept": "Affordances as Action Possibilities",
      "mapping": "Gibson defines affordances as what the environment offers the animal, neither purely objective nor subjective but relational. In SMoC: code affords different actions depending on the tool. A function affords 'execution' to runtime, 'static analysis' to linters, 'refactoring' to AI agents, 'understanding' to humans. Stone Tool principle: design code to afford AI analysis (structured, typed, documented) even if that makes it less 'clean' by human aesthetic standards.",
      "quotes_or_pages": [
        "Ch. 8: 'The Theory of Affordances'",
        "p.127: 'Affordances...are properties taken with reference to an observer'"
      ],
      "strength": "foundational"
    }
  ],
  "important_figures": [],
  "important_equations": [],
  "cross_references": [
    "REF-063"
  ],
  "gaps_or_extensions": "Gibson focuses on animal perception. SMoC extends to AI-code interaction and makes affordances explicit via schemas and types.",
  "generated_metadata": {
    "date": "2026-01-27",
    "model": "manual_analysis",
    "analyst": "llm_enrichment"
  },
  "priority_tier": 1
}
