{
  "ref_id": "REF-088",
  "title": "Structure-Mapping: A Theoretical Framework for Analogy",
  "authors": [
    "Gentner, D."
  ],
  "year": 1983,
  "source_type": "paper",
  "category": "VI.1 Analogy",
  "original_file": "pdf/REF-088_Gentner_1983_StructureMapping.pdf",
  "enhanced_txt": "txt/REF-088.txt",
  "images_dir": "images/REF-088/",
  "markdown_file": "md/REF-088.md",
  "page_count": 9,
  "image_count": 9,
  "token_count_estimate": 4273,
  "summary": "Gentner's 1983 paper introduces structure-mapping theory, arguing that analogies map relational structures between domains, not surface attributes. The theory explains how people understand metaphors, make inferences, and transfer knowledge across domains. Gentner proposes that analogy mapping preferentially aligns systems of connected relations (systematicity principle) and that structural consistency constraints guide the mapping process.",
  "smoc_relevance_summary": "Structure-mapping theory is the engine behind SMoC's analogy system for finding similar code patterns. When Collider finds analogous structures across modules, it uses Gentner's principles: map relations (function calls, data flows) not objects (variable names), prefer systematic multi-relation matches over superficial single matches, maintain structural consistency. This enables finding design patterns even when implementations differ—the relational structure (Template Method, Strategy) remains analogous despite different variable names or domains.",
  "key_smoc_concepts": [
    {
      "smoc_concept": "structure_mapping_analogy",
      "paper_concept": "Structure Mapping via Relational Alignment",
      "mapping": "Gentner's core insight: analogies align relations, not objects. In SMoC: finding similar code means matching graph structure (edges), not tokens (node labels). Two modules are analogous if they have isomorphic dependency graphs, regardless of naming. This is why refactoring to extract common patterns works—the relational structure is preserved even as concrete implementations change.",
      "quotes_or_pages": [
        "p.155: 'Analogies map relational structure'",
        "p.162: 'systematicity principle'"
      ],
      "strength": "foundational"
    }
  ],
  "important_figures": [],
  "important_equations": [],
  "cross_references": [],
  "gaps_or_extensions": "Gentner works with cognitive psychology. SMoC operationalizes via graph isomorphism algorithms and adds quantitative similarity scores.",
  "generated_metadata": {
    "date": "2026-01-27",
    "model": "manual_analysis",
    "analyst": "llm_enrichment"
  },
  "priority_tier": 1
}
